# MOVIE INDUSTRY EXPLORATION

Movie production can be a lucrative and glamorous business, and yet highly risky.
It is therefore important to choose moves into the movie industry wisely and with precaution.
The movie genres range from drama, comedy, action, adventure, horror, sciFi, and many more. 
Sometimes there is a thin line between movies that we are unable to distinguish one genre from the other. 
In such instances, we find that we can have romance/comedy or comedy/drama or even action/comedy.
The combinations are limitless.

##  Business Understanding

The goal of this project is to provide microsoft with information about the best movies to invest in.

## Objectives
1. Determine which movie genres are doing well in the industry
2. Find out which movies are most waatched based on rating
3. Find out which movies have the highest value based on their box office (domestic_gross + foreign_gross)

## Data understanding
The data used in this project comes from movie sites:
The data this project focuses on, is contained in the following tables:
1. bom.movie_gross.csv
2. movie_basics
3. movie_ratings

The project will focus on data about movie ratings, box office and movie genres.

## Data Analysis
The process of data analysis includes data cleaning and analysis, and finally visualization in form of graphs or bar charts.

In [1]:
# Importing relevant modules to assist in data cleaning, analysis and visualization.
import csv
import pandas as pd
import numpy as np
import sqlite3
conn = sqlite3.connect('data.sqlite')
cursor = conn.cursor()
import matplotlib.pyplot as plt
%matplotlib inline

### Table 1: bom.movie_gross

In [2]:
df1 = pd.read_csv('bom.movie_gross.csv')
df1

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

In [3]:
# checking for duplicates
df1.duplicated().value_counts()

False    3387
Name: count, dtype: int64

In [4]:
# checking for missing data and resolving
df1.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [5]:
#Replacing missing values in studio with 'NaN'
df1['studio'].replace('NaN', 'NaN', inplace=True)
df1['studio'].isna().sum()

5

In [6]:
df1['domestic_gross'].describe()

count    3.359000e+03
mean     2.874585e+07
std      6.698250e+07
min      1.000000e+02
25%      1.200000e+05
50%      1.400000e+06
75%      2.790000e+07
max      9.367000e+08
Name: domestic_gross, dtype: float64

In [7]:
#Replacing missing values in domestic gross with the standard deviation(std)
#Standard deviation was chosen because it is
df1['domestic_gross'].replace('NaN', 'std', inplace=True)
df1['domestic_gross'].isna().sum()

28

In [8]:
df1['foreign_gross'].mode()

0    1200000
Name: foreign_gross, dtype: object

In [9]:
#Replacing missing values in foreign_gross with the most frequent value(mode)
df1['foreign_gross'].replace('NaN', 'mode', inplace=True)
df1['foreign_gross'].isna().sum()

1350

In [10]:
#Confirming NaN values have been replaced
df1.isna().sum()

title                0
studio               5
domestic_gross      28
foreign_gross     1350
year                 0
dtype: int64

In [11]:
# Adding box office column which is the sum of domestic and foreign gross to the table
df1['domestic_gross'] = pd.to_numeric(df1['domestic_gross'], errors='coerce')
df1['foreign_gross'] = pd.to_numeric(df1['foreign_gross'], errors='coerce')
df1['box_office'] = df1['domestic_gross'] + df1['foreign_gross']
df1

,title,studio,domestic_gross,foreign_gross,year,box_office
0,Toy Story 3,BV,415000000.0,652000000.0,2010,1.067000e+09
1,Alice in Wonderland (2010),BV,334200000.0,691300000.0,2010,1.025500e+09
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000.0,2010,9.603000e+08
3,Inception,WB,292600000.0,535700000.0,2010,8.283000e+08
4,Shrek Forever After,P/DW,238700000.0,513900000.0,2010,7.526000e+08
...,...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018,NaN
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018,NaN
3384,El Pacto,Sony,2500.0,NaN,2018,NaN
3385,The Swan,Synergetic,2400.0,NaN,2018,NaN
3386,An Actor Prepares,Grav.,1700.0,NaN,2018,NaN

In [12]:
# Displaying relevant columns
df1[['title', 'domestic_gross', 'foreign_gross', 'box_office']].head(10)

,title,domestic_gross,foreign_gross,box_office
0,Toy Story 3,415000000.0,652000000.0,1.067000e+09
1,Alice in Wonderland (2010),334200000.0,691300000.0,1.025500e+09
2,Harry Potter and the Deathly Hallows Part 1,296000000.0,664300000.0,9.603000e+08
3,Inception,292600000.0,535700000.0,8.283000e+08
4,Shrek Forever After,238700000.0,513900000.0,7.526000e+08
5,The Twilight Saga: Eclipse,300500000.0,398000000.0,6.985000e+08
6,Iron Man 2,312400000.0,311500000.0,6.239000e+08
7,Tangled,200800000.0,391000000.0,5.918000e+08
8,Despicable Me,251500000.0,291600000.0,5.431000e+08
9,How to Train Your Dragon,217600000.0,277300000.0,4.949000e+08

In [95]:
# Combining bom_movie with tmdb.movies to access genre column from tmdb
df2 = pd.read_csv('tmdb.movies.csv')
merged_df = pd.merge(df1, df2, on='title', how='inner')
merged_df.head(10)

,title,studio,domestic_gross,foreign_gross,year,box_office,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,vote_average,vote_count
0,Toy Story 3,BV,415000000.0,652000000.0,2010,1.067000e+09,7,"[16, 10751, 35]",10193,en,Toy Story 3,24.445,2010-06-17,7.7,8340
1,Inception,WB,292600000.0,535700000.0,2010,8.283000e+08,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,8.3,22186
2,Shrek Forever After,P/DW,238700000.0,513900000.0,2010,7.526000e+08,38,"[35, 12, 14, 16, 10751]",10192,en,Shrek Forever After,15.041,2010-05-16,6.1,3843
3,The Twilight Saga: Eclipse,Sum.,300500000.0,398000000.0,2010,6.985000e+08,15,"[12, 14, 18, 10749]",24021,en,The Twilight Saga: Eclipse,20.340,2010-06-23,6.0,4909
4,Iron Man 2,Par.,312400000.0,311500000.0,2010,6.239000e+08,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,6.8,12368
5,Tangled,BV,200800000.0,391000000.0,2010,5.918000e+08,13,"[16, 10751]",38757,en,Tangled,21.511,2010-11-24,7.5,6407
6,Despicable Me,Uni.,251500000.0,291600000.0,2010,5.431000e+08,8,"[16, 10751, 35]",20352,en,Despicable Me,23.673,2010-07-09,7.2,10057
7,How to Train Your Dragon,P/DW,217600000.0,277300000.0,2010,4.949000e+08,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,7.7,7610
8,The Chronicles of Narnia: The Voyage of the Da...,Fox,104400000.0,311300000.0,2010,4.157000e+08,22,"[12, 10751, 14]",10140,en,The Chronicles of Narnia: The Voyage of the Da...,17.382,2010-12-10,6.3,3196
9,The King's Speech,Wein.,135500000.0,275400000.0,2010,4.109000e+08,25,"[18, 36]",45269,en,The King's Speech,16.798,2010-09-06,7.7,5013

In [14]:
merged_df[['genre_ids', 'domestic_gross', 'foreign_gross']].head(5)

                 genre_ids  domestic_gross  foreign_gross
0          [16, 10751, 35]     415000000.0    652000000.0
1            [28, 878, 12]     292600000.0    535700000.0
2  [35, 12, 14, 16, 10751]     238700000.0    513900000.0
3      [12, 14, 18, 10749]     300500000.0    398000000.0
4            [12, 28, 878]     312400000.0    311500000.0

In [96]:
data = {
    'genre_ids': ['16, 10751, 35', '28, 878, 12', '35, 12, 14, 16, 10751', '12, 14, 18, 10749', '12, 28, 878']
}
merged_df = pd.DataFrame(data)
merged_df['genre_ids'].replace({'16, 10751, 35': 'animation family comedy', '28, 878, 12': 'action scifi adventure', 
                    '35, 12, 14, 16, 10751': 'comedy adventure fantasy animation family',
                    '12, 14, 18, 10749':'adventure fantasy drama romance', '12, 28, 878':'adventure action scifi'}, inplace=True)
merged_df

,title,studio,domestic_gross,foreign_gross,year,box_office,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,vote_average,vote_count
0,Toy Story 3,BV,415000000.0,652000000.0,2010,1.067000e+09,7,"[16, 10751, 35]",10193,en,Toy Story 3,24.445,2010-06-17,7.7,8340
1,Inception,WB,292600000.0,535700000.0,2010,8.283000e+08,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,8.3,22186
2,Shrek Forever After,P/DW,238700000.0,513900000.0,2010,7.526000e+08,38,"[35, 12, 14, 16, 10751]",10192,en,Shrek Forever After,15.041,2010-05-16,6.1,3843
3,The Twilight Saga: Eclipse,Sum.,300500000.0,398000000.0,2010,6.985000e+08,15,"[12, 14, 18, 10749]",24021,en,The Twilight Saga: Eclipse,20.340,2010-06-23,6.0,4909
4,Iron Man 2,Par.,312400000.0,311500000.0,2010,6.239000e+08,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,6.8,12368
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2698,The Escape,IFC,14000.0,NaN,2018,NaN,16803,"[53, 28]",459814,en,The Escape,0.600,2015-08-14,7.0,1
2699,The Escape,IFC,14000.0,NaN,2018,NaN,19053,"[53, 28]",417004,en,The Escape,1.176,2016-10-23,6.6,10
2700,Souvenir,Strand,11400.0,NaN,2018,NaN,18483,"[35, 18]",408258,fr,Souvenir,2.130,2016-09-08,5.8,14
2701,The Quake,Magn.,6200.0,NaN,2018,NaN,24107,[12],416194,no,Skjelvet,11.051,2018-12-14,6.7,81
2702,An Actor Prepares,Grav.,1700.0,NaN,2018,NaN,24419,"[35, 18]",434596,en,An Actor Prepares,7.244,2018-08-31,6.5,10

In [62]:
merged_df

                                   genre_ids
0                    animation family comedy
1                     action scifi adventure
2  comedy adventure fantasy animation family
3            adventure fantasy drama romance
4                     adventure action scifi

# Table 2: movie_basics

In [17]:
#Acquiring database path so as to view our data
conn = sqlite3.connect('im.db')
db_path = conn.execute("PRAGMA database_list;").fetchall()[0][1]

In [18]:
#Previewing available tables from the database
table_name_query = """SELECT name
                      AS 'Table Names' 
                      FROM sqlite_master
                      WHERE type='table';"""

pd.read_sql(table_name_query, conn)

     Table Names
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [19]:
#Previewing data from movie_basics
first_query = """
SELECT *
FROM movie_basics
;
"""
pd.read_sql(first_query, conn)

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho TeÃ³philo - O Legado de um Pioneiro,Rodolpho TeÃ³philo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - RevelaÃ§Ãµes,Chico Albuquerque - RevelaÃ§Ãµes,2013,NaN,Documentary

In [20]:
#Checking for null values
second_query = """
SELECT genres
FROM movie_basics
WHERE genres IS NULL
;
"""
pd.read_sql(second_query, conn)

     genres
0      None
1      None
2      None
3      None
4      None
...     ...
5403   None
5404   None
5405   None
5406   None
5407   None

[5408 rows x 1 columns]

In [21]:
#Checking for top movies in terms of genre
third_query = """
SELECT genres, count(*) AS frequency
FROM movie_basics
GROUP by genres
ORDER BY frequency DESC
LIMIT 10
;
"""
pd.read_sql(third_query, conn)

                  genres  frequency
0            Documentary      32185
1                  Drama      21486
2                 Comedy       9177
3                   None       5408
4                 Horror       4372
5           Comedy,Drama       3519
6               Thriller       3046
7                 Action       2219
8  Biography,Documentary       2115
9          Drama,Romance       2079

#  Table 3(movie_ratings)

In [22]:
#Previewing data from movie_basics
fourth_query = """
SELECT *
FROM movie_ratings
;
"""
pd.read_sql(fourth_query, conn)

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

# tmdb.movies

In [23]:
df2 = pd.read_csv('tmdb.movies.csv')
df2

,Unnamed: 0,genre_ids,id,original_language,original_title,popularity,release_date,title,vote_average,vote_count
0,0,"[12, 14, 10751]",12444,en,Harry Potter and the Deathly Hallows: Part 1,33.533,2010-11-19,Harry Potter and the Deathly Hallows: Part 1,7.7,10788
1,1,"[14, 12, 16, 10751]",10191,en,How to Train Your Dragon,28.734,2010-03-26,How to Train Your Dragon,7.7,7610
2,2,"[12, 28, 878]",10138,en,Iron Man 2,28.515,2010-05-07,Iron Man 2,6.8,12368
3,3,"[16, 35, 10751]",862,en,Toy Story,28.005,1995-11-22,Toy Story,7.9,10174
4,4,"[28, 878, 12]",27205,en,Inception,27.920,2010-07-16,Inception,8.3,22186
...,...,...,...,...,...,...,...,...,...,...
26512,26512,"[27, 18]",488143,en,Laboratory Conditions,0.600,2018-10-13,Laboratory Conditions,0.0,1
26513,26513,"[18, 53]",485975,en,_EXHIBIT_84xxx_,0.600,2018-05-01,_EXHIBIT_84xxx_,0.0,1
26514,26514,"[14, 28, 12]",381231,en,The Last One,0.600,2018-10-01,The Last One,0.0,1
26515,26515,"[10751, 12, 28]",366854,en,Trailer Made,0.600,2018-06-22,Trailer Made,0.0,1
26516,26516,"[53, 27]",309885,en,The Church,0.600,2018-10-05,The Church,0.0,1

In [24]:
df2['genre_ids'].value_counts().head(6)

genre_ids
[99]    3700
[]      2479
[18]    2268
[35]    1660
[27]    1145
[53]     480
Name: count, dtype: int64

In [25]:
# To change genre_ids to name/genre, I referenced data from 'https://developers.themoviedb.org/3/genres/get-movie-list'. 
# Here the movie genre_ids are assigned to their respective genre names.
df2['genre_ids'].replace([35], ['Comedy'], inplace=True)
df2['genre_ids'].replace([18], ['Drama'], inplace=True)
df2['genre_ids'].replace([99], ['Documentary'], inplace=True)
df2['genre_ids'].replace([27], ['Horror'], inplace=True)
df2['genre_ids'].value_counts()

genre_ids
[99]                       3700
[]                         2479
[18]                       2268
[35]                       1660
[27]                       1145
                           ...
[37, 12]                      1
[10752, 878]                  1
[28, 53, 10749, 18, 35]       1
[99, 80, 53, 36]              1
[10751, 12, 28]               1
Name: count, Length: 2477, dtype: int64

In [26]:
df2['genre_ids'].value_counts().head(6)

genre_ids
[99]    3700
[]      2479
[18]    2268
[35]    1660
[27]    1145
[53]     480
Name: count, dtype: int64

In [27]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26517 entries, 0 to 26516
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Unnamed: 0         26517 non-null  int64
 1   genre_ids          26517 non-null  object
 2   id                 26517 non-null  int64
 3   original_language  26517 non-null  object
 4   original_title     26517 non-null  object
 5   popularity         26517 non-null  float64
 6   release_date       26517 non-null  object
 7   title              26517 non-null  object
 8   vote_average       26517 non-null  float64
 9   vote_count         26517 non-null  int64
dtypes: float64(2), int64(3), object(5)
memory usage: 2.0+ MB

In [28]:
# Checking for duplicates

In [29]:
df2.duplicated().value_counts()

False    26517
Name: count, dtype: int64

In [30]:
# checking for missing data

In [31]:
df2.isna().sum()

Unnamed: 0           0
genre_ids            0
id                   0
original_language    0
original_title       0
popularity           0
release_date         0
title                0
vote_average         0
vote_count           0
dtype: int64

# tn.movie_budgets

In [32]:
df3 = pd.read_csv('tn.movie_budgets.csv')
df3

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [33]:
# checking for missing values

In [34]:
df3.isna().sum()

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [35]:
# checking for duplicates

In [36]:
df3.duplicated().sum()

0

# rt movie info

In [37]:
df4 = pd.read_csv('rt.movie_info.tsv', sep='\t')
df4

,id,synopsis,rating,genre,director,writer,theater_date,dvd_date,currency,box_office,runtime,studio
0,1,"This gritty, fast-paced, and innovative police...",R,Action and Adventure|Classics|Drama,William Friedkin,Ernest Tidyman,"Oct 9, 1971","Sep 25, 2001",NaN,NaN,104 minutes,NaN
1,3,"New York City, not-too-distant-future: Eric Pa...",R,Drama|Science Fiction and Fantasy,David Cronenberg,David Cronenberg|Don DeLillo,"Aug 17, 2012","Jan 1, 2013",$,"600,000",108 minutes,Entertainment One
2,5,Illeana Douglas delivers a superb performance ...,R,Drama|Musical and Performing Arts,Allison Anders,Allison Anders,"Sep 13, 1996","Apr 18, 2000",NaN,NaN,116 minutes,NaN
3,6,Michael Douglas runs afoul of a treacherous su...,R,Drama|Mystery and Suspense,Barry Levinson,Paul Attanasio|Michael Crichton,"Dec 9, 1994","Aug 27, 1997",NaN,NaN,128 minutes,NaN
4,7,NaN,NR,Drama|Romance,Rodney Bennett,Giles Cooper,NaN,NaN,NaN,NaN,200 minutes,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
1555,1996,Forget terrorists or hijackers -- there's a ha...,R,Action and Adventure|Horror|Mystery and Suspense,NaN,NaN,"Aug 18, 2006","Jan 2, 2007",$,"33,886,034",106 minutes,New Line Cinema
1556,1997,The popular Saturday Night Live sketch was exp...,PG,Comedy|Science Fiction and Fantasy,Steve Barron,Terry Turner|Tom Davis|Dan Aykroyd|Bonnie Turner,"Jul 23, 1993","Apr 17, 2001",NaN,NaN,88 minutes,Paramount Vantage
1557,1998,"Based on a novel by Richard Powell, when the l...",G,Classics|Comedy|Drama|Musical and Performing Arts,Gordon Douglas,NaN,"Jan 1, 1962","May 11, 2004",NaN,NaN,111 minutes,NaN
1558,1999,The Sandlot is a coming-of-age story about a g...,PG,Comedy|Drama|Kids and Family|Sports and Fitness,David Mickey Evans,David Mickey Evans|Robert Gunter,"Apr 1, 1993","Jan 29, 2002",NaN,NaN,101 minutes,NaN
1559,2000,"Suspended from the force, Paris cop Hubert is ...",R,Action and Adventure|Art House and Internation...,NaN,Luc Besson,"Sep 27, 2001","Feb 11, 2003",NaN,NaN,94 minutes,Columbia Pictures

In [38]:
df4['box_office'].value_counts()

box_office
600,000        2
32,000,000     2
200,000        2
20,900,803     2
119,000,000    1
              ..
6,100,613      1
15,687,400     1
300,000        1
1,800,000      1
33,886,034     1
Name: count, Length: 336, dtype: int64

In [39]:
# checking for missing values
df4.isna().sum()

id                 0
synopsis          62
rating             3
genre              8
director         199
writer           449
theater_date     359
dvd_date         359
currency        1220
box_office      1220
runtime           30
studio          1066
dtype: int64

In [40]:
# checking for duplicates
df4.duplicated().sum()

0

In [41]:
#checking best performing movie genres
df4['genre'].value_counts().head(10)

genre
Drama                                              151
Comedy                                             110
Comedy|Drama                                        80
Drama|Mystery and Suspense                          67
Art House and International|Drama                   62
Action and Adventure|Drama                          42
Action and Adventure|Drama|Mystery and Suspense     40
Drama|Romance                                       35
Comedy|Romance                                      32
Art House and International|Comedy|Drama            31
Name: count, dtype: int64

In [42]:
# Renaming genre names to conventional method 
# Finding out top 5 genres
df4['genre'].replace('Drama|Romance', 'Drama', inplace=True)
df4['genre'].replace('Drama|Mystery and Suspense', 'Drama', inplace=True)
df4['genre'].replace('Comedy|Drama', 'Comedy', inplace=True)
df4['genre'].replace('Action and Adventure|Drama', 'Action and Adventure', inplace=True)
df4['genre'].replace('Action and Adventure|Drama|Mystery and Suspense', 'Action and Adventure', inplace=True)
df4['genre'].replace('Comedy|Romance', 'Comedy', inplace=True)
df4['genre'].replace('Art House and International|Drama', 'Drama', inplace=True)
df4['genre'].replace('Art House and International|Comedy|Drama', 'Comedy', inplace=True)
df4['genre'].replace('Action and Adventure|Science Fiction and Fantasy', 'Action and Adventure', inplace=True)
df4['genre'].replace('Comedy|Drama|Romance', 'Comedy', inplace=True)
df4['genre'].value_counts().head()

genre
Drama                   315
Comedy                  276
Action and Adventure    125
Horror                   31
Classics|Drama           21
Name: count, dtype: int64

In [43]:
# Drama, Comedy, and Action and Adventure, are the most watched movies based on genre.

In [44]:
# Checking which movies based on rating are most watched
df4['rating'].value_counts()

rating
R        521
NR       503
PG       240
PG-13    235
G         57
NC17       1
Name: count, dtype: int64

In [45]:
# Movies rated R, NR, PG and PG-13 are the top most watched movies

# rt.reviews

In [46]:
df4 = pd.read_csv('rt.reviews.tsv', sep='\t', encoding='latin')
df4

,id,review,rating,fresh,critic,top_critic,publisher,date
0,3,A distinctly gallows take on contemporary fina...,3/5,fresh,PJ Nabarro,0,Patrick Nabarro,"November 10, 2018"
1,3,It's an allegory in search of a meaning that n...,NaN,rotten,Annalee Newitz,0,io9.com,"May 23, 2018"
2,3,... life lived in a bubble in financial dealin...,NaN,fresh,Sean Axmaker,0,Stream on Demand,"January 4, 2018"
3,3,Continuing along a line introduced in last yea...,NaN,fresh,Daniel Kasman,0,MUBI,"November 16, 2017"
4,3,... a perverse twist on neorealism...,NaN,fresh,NaN,0,Cinema Scope,"October 12, 2017"
...,...,...,...,...,...,...,...,...
54427,2000,The real charm of this trifle is the deadpan c...,NaN,fresh,Laura Sinagra,1,Village Voice,"September 24, 2002"
54428,2000,NaN,1/5,rotten,Michael Szymanski,0,Zap2it.com,"September 21, 2005"
54429,2000,NaN,2/5,rotten,Emanuel Levy,0,EmanuelLevy.Com,"July 17, 2005"
54430,2000,NaN,2.5/5,rotten,Christopher Null,0,Filmcritic.com,"September 7, 2003"
54431,2000,NaN,3/5,fresh,Nicolas Lacroix,0,Showbizz.net,"November 12, 2002"

In [47]:
# Checking for missing values 
df4['rating'].isna().value_counts()

rating
False    40915
True     13517
Name: count, dtype: int64

In [48]:
# Replacing missing values with the most frequent rating
df4['rating'].mode()

mode = df4['rating'].mode()
df4['rating'].fillna(value=mode, inplace=True)
df4['rating'].isna().value_counts()

rating
False    40915
True     13517
Name: count, dtype: int64

In [49]:
#Showing top movies
df4['rating'].value_counts().head(15)

rating
3/5      4327
4/5      3672
3/4      3577
2/5      3160
2/4      2712
2.5/4    2381
3.5/4    1777
3.5/5    1289
5/5      1237
B        1163
1/5      1113
1.5/4    1095
4/4       995
2.5/5     992
B+        832
Name: count, dtype: int64

In [50]:
first_query = """
SELECT *
FROM movie_reviews
;
"""
pd.read_sql(first_query, conn)

DatabaseError: Execution failed on sql '
SELECT *
FROM movie_reviews
;
': no such table: movie_reviews

In [ ]:
first_query = """
SELECT *
FROM movie_ratings
;
"""
# Use the line below to check your query's output
pd.read_sql(first_query, conn).head()